package org.orrs.test;

import com.hankcs.hanlp.HanLP;

public class TestHanLPExample {
	
	private static final int SIZE = 5;
	
	private static String str[] = {
			"福斯新聞網（Fox News）報導，川普在自家社群網站真實社群（Truth Social）發文說：「喬（拜登）對韓特的特赦，是否包含已被監禁多年的J-6人質（J-6 Hostages）？」他還寫說：「司法遭如此的濫用和不公！」"
	    			+ "川普一再將因國會山莊暴動案入獄的囚犯指為「人質」，即便先前曾有法官不接受這樣的描述。"
	    			+ "川普的過渡團隊也對韓特獲特赦一事做出回應。"
	    			+ "英國廣播公司新聞網（BBC News）報導，川普發言人、即將接掌白宮聯絡室的史蒂芬．張（Steven Cheung）雖沒有具體提及韓特的案子，但發布聲明表示，司法系統已經崩壞。"
	    			+ "他說：「針對總統川普的獵巫行動失敗，證明了將司法系統武器化一事，民主黨控制的司法部和其他激進檢察官有罪。」"
	    			+ "「司法體系必須整頓，合法訴訟程序必須修復，這是為了所有美國人著想，也正是總統川普帶著美國人民壓倒性授權重返白宮時所要做的事。」"
	    			+ "川普選前曾向福斯新聞網記者梅魯金（Bill Melugin）表示，如果當選，他「不會對韓特的案件蓄意做出任何事情」，並稱韓特的法律問題是「令人難過的情況」。（譯者：蔡佳敏/核稿：劉文瑜）1131202"
	    	,
	    	
	    	"未來1周受到東北季風增強影響，水氣漸增，中央氣象署預報員張竣堯表示，周二至周五北東有局部短暫雨，周六有一波較強冷空氣南下，周日至下周一2天影響最為顯著，有機會接近大陸冷氣團，北部、宜蘭及花蓮低溫下探14度。"
	    	+ "張竣堯說，明天東北季風增強，影響周二至周五）天氣，大台北、東北部及東部地區有局部短暫降雨，尤其明天宜蘭山區有局部大雨，北部山區及台東有短暫陣雨，其他地區多雲到晴。"
	    	+ "張竣堯表示，預估周六（7日）有一波冷空氣南下，有機會接近大陸冷氣團等級，周日至下周一（8、9日）影響最顯著，相較上周乾冷的冷氣團，這波冷空氣屬於濕冷的型態，北部、東半部降雨時間較長，整日持續有雨，中南部則維持多雲到晴的天氣。"
	    	+ "下周二（10日）大陸冷氣團將稍為減弱，氣溫回升，水氣也有減少趨勢，大台北及東半部地區仍有局部短暫雨，其他地區為多雲到晴。"
	    	+ "下周三、周四（11、12日）東北季風再度增強，氣溫又將下降，北部及東北部轉涼；北部及東半部地區有局部短暫雨，其他地區為多雲到晴。"
	    	+ "溫度部分，張竣堯指出，明天至周五（3至6日）受到東北季風增強影響，各地低溫為16至20度，北部、宜花地區白天高溫較涼，約20至24度，中南部及台東白天高溫26至28度。"
	    	+ "周六（7日）有一波冷空氣南下，需注意低溫變化，周日至下周一（8、9日）受到東北季風或大陸冷氣團影響，各地氣溫下降，是這周降溫最明顯的2天，北部、宜花地區低溫有機會下探14、15度，其他地區16至18度，早晚較冷。"
	    	+ "張竣堯表示，周六這波冷空氣，其強度有機會達到大陸冷氣團等級，到時間較為長久，仍有不確定性，需再觀察明後2天情況較為明朗，但相較周五前的溫度，「周六以後的溫度明顯下降」，尤其北部、宜花地區因下雨緣故，體感較為濕冷。"
	};
	
    public static void main(String[] args) {
    	for (String s : str) {
    		System.out.println("--------------------------------------------------------");
        	System.out.println( HanLP.extractKeyword(s, SIZE) );
        	System.out.println( HanLP.extractPhrase(s, SIZE) );
        	System.out.println( HanLP.extractSummary(s, SIZE) );
        	System.out.println( HanLP.segment(s) );
    	}
    	
    }
    
}